In [1]:
import pandas as pd 
import numpy as np 
data=pd.read_csv('data.csv')

In [2]:
df = pd.DataFrame(data)
df

      name  age gender  Marks
0      Jai   17      M   90.0
1   Princi   17      F   76.0
2   Gaurav   18      M    NaN
3     Anuj   17      M   74.0
4     Ravi   18      M   65.0
5  Natasha   17      F    NaN
6     Riya   17      F   71.0

In [3]:
# Dealing with missing values and Reshaping Data
avg = df.mean(numeric_only=True)
df['Marks'] = df['Marks'].fillna(avg['Marks'])
df['gender'] = df['gender'].map({'M':0, 'F':1}).astype(float)
print('avg = ',avg['Marks'])
df

avg =  75.2

      name  age  gender  Marks
0      Jai   17     0.0   90.0
1   Princi   17     1.0   76.0
2   Gaurav   18     0.0   75.2
3     Anuj   17     0.0   74.0
4     Ravi   18     0.0   65.0
5  Natasha   17     1.0   75.2
6     Riya   17     1.0   71.0

In [4]:
# Creating DataFrame for Student Details
details = pd.DataFrame({
    'ID' : [101,102,103,104,105,106,107,108,109,110],
    'NAME': ['Jagroop','Parveen', 'Harjot', 'Pooha', 'Rahul', 'Nikita', 'Saurabh', 'Ayush', 'Dolly', 'Mohit'],
    'BRANCH' : ['CSE', 'CSE', 'CSE', 'CSE', 'CSE', 'CSE', 'CSE', 'CSE', 'CSE', 'CSE' ],
    })

#Creating Dataframe for Fees_Status
fees_status = pd.DataFrame({
    "ID" : [101,102,103,104,105,106,107,108,109,110],
    "PENDING" : ['5000', '250', 'NIL', '9000', '15000', 'NIL', '4500', '1800', '250', 'NIL']
})

#Printing details
print(details)

#Printing fees_status
print("\n\n",fees_status)

    ID     NAME BRANCH
0  101  Jagroop    CSE
1  102  Parveen    CSE
2  103   Harjot    CSE
3  104    Pooha    CSE
4  105    Rahul    CSE
5  106   Nikita    CSE
6  107  Saurabh    CSE
7  108    Ayush    CSE
8  109    Dolly    CSE
9  110    Mohit    CSE


     ID PENDING
0  101    5000
1  102     250
2  103     NIL
3  104    9000
4  105   15000
5  106     NIL
6  107    4500
7  108    1800
8  109     250
9  110     NIL

In [5]:
# Merging Dataframe
print(pd.merge(details, fees_status, on='ID'))

    ID     NAME BRANCH PENDING
0  101  Jagroop    CSE    5000
1  102  Parveen    CSE     250
2  103   Harjot    CSE     NIL
3  104    Pooha    CSE    9000
4  105    Rahul    CSE   15000
5  106   Nikita    CSE     NIL
6  107  Saurabh    CSE    4500
7  108    Ayush    CSE    1800
8  109    Dolly    CSE     250
9  110    Mohit    CSE     NIL